taruntom1/lora_link_layer/examples/sender/sdkconfig.defaults
# Sender example — node-specific defaults.
# Override GPIO assignments for your hardware via menuconfig.
CONFIG_LORA_NODE_ID=0x0001
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_LORA_PIN_SCK=12
CONFIG_LORA_PIN_MISO=13
CONFIG_LORA_PIN_MOSI=11
CONFIG_LORA_PIN_NSS=10
CONFIG_LORA_PIN_RST=9
CONFIG_LORA_PIN_DIO0=4
CONFIG_LORA_PIN_DIO1=5